[Killed] BlockStatement
src/app/pipes/contact-name.pipe.ts:6:42
 
 @Pipe({ name : 'contactName'})
 export class ContactNamePipe implements PipeTransform {
-    transform(contact: Contact) : string {
-        if (contact.firstName) {
-            if(contact.surname)
-                return `${contact.firstName} ${contact.surname}`;
-            return `${contact.firstName}`
-        }
-        return ''
-    }
+    transform(contact: Contact) : string {}
 
 }
killedBy: Pipe: ContactName should concatenate a contact name
statusReason: Expected undefined to be 'Chris Pannenkoek'.

[Killed] ConditionalExpression
src/app/pipes/contact-name.pipe.ts:7:13
 @Pipe({ name : 'contactName'})
 export class ContactNamePipe implements PipeTransform {
     transform(contact: Contact) : string {
-        if (contact.firstName) {
+        if (false) {
             if(contact.surname)
                 return `${contact.firstName} ${contact.surname}`;
killedBy: Pipe: ContactName should concatenate a contact name
statusReason: Expected '' to be 'Chris Pannenkoek'.

[Killed] ConditionalExpression
src/app/pipes/contact-name.pipe.ts:7:13
 @Pipe({ name : 'contactName'})
 export class ContactNamePipe implements PipeTransform {
     transform(contact: Contact) : string {
-        if (contact.firstName) {
+        if (true) {
             if(contact.surname)
                 return `${contact.firstName} ${contact.surname}`;
killedBy: Pipe: ContactName should return empty string when firstName is undefined
statusReason: Expected 'undefined Pannenkoek' to be ''.

[Killed] ConditionalExpression
src/app/pipes/contact-name.pipe.ts:8:16
 export class ContactNamePipe implements PipeTransform {
     transform(contact: Contact) : string {
         if (contact.firstName) {
-            if(contact.surname)
+            if(false)
                 return `${contact.firstName} ${contact.surname}`;
             return `${contact.firstName}`
killedBy: Pipe: ContactName should concatenate a contact name
statusReason: Expected 'Chris' to be 'Chris Pannenkoek'.

[Killed] ConditionalExpression
src/app/pipes/contact-name.pipe.ts:8:16
 export class ContactNamePipe implements PipeTransform {
     transform(contact: Contact) : string {
         if (contact.firstName) {
-            if(contact.surname)
+            if(true)
                 return `${contact.firstName} ${contact.surname}`;
             return `${contact.firstName}`
killedBy: Pipe: ContactName should return only firstname when surname is empty
statusReason: Expected 'Chris ' to be 'Chris'.

[Killed] StringLiteral
src/app/pipes/contact-name.pipe.ts:12:16
                 return `${contact.firstName} ${contact.surname}`;
             return `${contact.firstName}`
         }
-        return ''
+        return "Stryker was here!"
     }
 
killedBy: Pipe: ContactName should return empty string when firstName is undefined
statusReason: Expected 'Stryker was here!' to be ''.
